{
    "reserve-message": "Здравствуйте! Я хочу забронировать столик на",
    "adress": "Баку, Насиминский р-н., Мехбали Зейналабдиев 5",
    "time": "Ежедневно 11:00 — 22:00",
    "menu": {
        "0": "Главная",
        "1": "О нас",
        "2": "Меню",
        "3": "Акции",
        "4": "Отзывы",
        "5": "Магазин",
        "6": "Галерея",
        "7": "Блог",
        "8": "Контакты"
    },
    "home": {
        "title-1": "Де Рама",
        "title-2": "Вегетарианское & Веганское кафе",
        "subtitle": "Изменив то что вы едите, вы можете изменить свой внутренний и внешний мир.",
        "text": "Хотите попробовать наши вкуснейшие блюда? Тогда спешите забронировать стол 💚 Разнообразная кухня со всего мира  — без яиц и никаких видов мяса. ",
        "btn-1": "Бронировать стол",
        "btn-2": "Смотреть меню"
    },
    "about": {
        "title": "О нас",
        "text-top-1": "Научные исследования утверждают, что, перейдя от животной к растительной диете, мы можем положительно повлиять на планету, окружающую среду, климат и даже на самих себя.",
        "text-top-2": "Каждый положительный выбор пищи, который мы делаем каждый день, каким бы маленьким он ни был, окажет большое положительное влияние на наш внутренний и внешний мир.",
        "subtitle": "Почему кафе называется Рама?",
        "text-b-1": "Ра́ма (санскр. राम, IAST: rāma) или Рамача́ндра (Рама, светлый, как месяц — аватара Вишну, легендарный древне ведический царь Айодхьи. Рама считается в ведической культуре как седьмая аватара Вишну, сошедшая в мир в последнюю четверть Трета-юги около 1,2 млн лет тому назад. Когда Парашурама занят творением и сохранением мирового порядка, то в этом случае Рама в качестве его аватары «призван отстоять достоинство брака, как выражения вечной и неразрывной связи между мужем и женой».",
        "text-b-2": "Последователи Ведической Культуры считают Раму реально существовавшей исторической фигурой, царём, правившим большей частью современной Индии из своей столицы Айодхьи. Наряду с Кришной, Рама является одной из самых популярных аватар Бога. Культ Рамы особенно характерен для последователей вайшнавизма — преобладающего направления в индуизме.",
        "text-b-3-1": "Подробнее жизнеописание Рамы содержится в:",
        "text-b-3-2": "«Рамаяне» - Художественный Фильм:",
        "text-b-3-3": "одном из двух величайших древневедических эпосов, «Махабхарата» - Художественный Фильм:"
    },
    "menu-f": {
        "title1": "Меню — блюда",
        "title2": "Меню — напитки безалкогольные",
        "title3": "Меню — напитки алкогольные",
        "to-category": "вернуться к категориям",
        "text-1": "Приходите к нам за вкусной едой и приятными впечатлениями!",
        "text-2": "Также доступна возможность заказать нашу еду с доставкой на дом.",
        "btn-1": "Бронировать стол",
        "btn-2": "Заказать в Wolt",
        "btn-3": "Заказать в Bolt"
    },
    "action": {
        "title": "Акции",
        "days": "Понедельник — Пятница",
        "off": "СКИДКА"
    },
    "review": {
        "title": "Отзывы наших гостей",
        "1": "Большой ассортимент блюд со всего мира. множество вариантов, от фаст-фуда до традиционных местных блюд. Все они являются либо вегетарианскими, либо веганскими.",
        "2": "Очень приятно иметь такое место в Баку. Маленькое кафе на тихой улочке, спокойная музыка, очень вкусная еда.",
        "3": "Очень понравилось! Расслабляющая атмосфера, приятный интерьер, вкусная еда, отличный сервис. Очень понравился домашний лимонад.",
        "4": "Такая классная обстановка и вкусная еда! Веганские варианты всех блюд. Очень дзенское ощущение от этого места.",
        "5": "Хорошее обслуживание и очень дружелюбный персонал. Я попробовал чизбургер, отличный, влажный, и булочка со свеклой была отличной.",
        "6": "Большинство блюд в меню веганские или могут быть веганскими. У меня был бургер, приготовленный из BEYOND MEAT, и это меня очень порадовало. Также хорошая зона отдыха на открытом воздухе с джазовой музыкой.",
        "7": "Веганские и вегетарианские блюда со всего мира. Впервые вижу такое яркое и интересное меню! Уютная атмосфера. В этом семейном кафе также есть интересные книги о веганской и вегетарианской кухне.",
        "8": "Очень быстро принесли напитки и еду, в нужном порядке о котором просили и ничего не перепутали.  Напитки холодные + принесли лед.",
        "9": "Искали вегетарианское кафе в Баку, нашли это и просто счастливы! Большой выбор блюд, приятное обслуживание, к кофе конфетку дают)",
        "10": "Как вегетарианцы, мы ожидали, что в Баку нам придется трудно с нашими диетическими требованиями. Но в тот момент, когда мы посетили кафе DeRama, мы были так счастливы! Качество и количество еды отличное. Особенно вкусны щи из красной капусты, лапша, макароны, долма и десерт «Сникерс»."
    },
    "shop": {
        "title": "Де Рама Магазин",
        "text": "Представляем вашему вниманию наши товары и сувениры, которые будут напоминать вам о маленьком вегетаринском кафе, спрятанном на тихой тенистой улочке Баку. Наша продукция практична, эстетична, подойдет в качестве подарка как самому себе, так и близким.",
        "btn": "Смотреть еще"
    },
    "blog": {
        "title": "Блог",
        "text": "Заварите зеленого чаю с ромашкой и насладитесь чтением наших статей.",
        "btn": "Читать еще",
        "btn2": "Читать"
    },
    "gallery": "Галерея",
    "contact": {
        "title": "Контакты",
        "place": "Район станции метро 28 Мая, Конец парка Самеда Вургуна, за зданием Главного управления железной дороги, рядом с Аэрофлот Аэрокасса",
        "parking": "Парковка в рабочие дни только после 17:30, в нерабочие дни доступна в любое время."
    }
}